Revit 2027 API
Face.Reference Property
Returns a stable reference to the face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Reference Reference { get; }
Public ReadOnly Property Reference As Reference
	Get
public:
property Reference^ Reference {
	Reference^ get ();
}
member Reference : Reference with get
Property Value
Reference
This value may be if the object does not store a corresponding reference. This might be due to any of the following reasons:
The face was obtained from an API member which does not permit options to generate corresponding References (most API members, besides Element.Geometry, do not have an option to generate a Reference).
The corresponding geometry object does not permit referencing.
See Also
Reference
Face Class
Autodesk.Revit.DB Namespace